---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledBarSize
source: html/f5b2c89d-4800-80be-af7a-ef13dffe16d2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledBarSize Property

"Bar Size 2"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerCoupledBarSize { get; }
```